Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/svd/PIC32CX1012BZ25048.svd
            <register>
               <name>SCOM0P0R</name>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOM0P0</name>
                     <description>SERCOM0/PAD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SCOM0P0Select</name>
                        <enumeratedValue>
                           <name>RPA0</name>
                           <description>RPA0</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA12</name>
                           <description>RPA12</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB1</name>
                           <description>RPB1</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB13</name>
                           <description>RPB13</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA11</name>
                           <description>RPA11</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB0</name>
                           <description>RPB0</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB12</name>
                           <description>RPB12</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCOM0P1R</name>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOM0P1</name>
                     <description>SERCOM0/PAD1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SCOM0P1Select</name>
                        <enumeratedValue>
                           <name>RPA1</name>
                           <description>RPA1</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA13</name>
                           <description>RPA13</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB2</name>
                           <description>RPB2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB10</name>
                           <description>RPB10</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA0</name>
                           <description>RPA0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA12</name>
                           <description>RPA12</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB1</name>
                           <description>RPB1</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB13</name>
                           <description>RPB13</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCOM0P2R</name>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOM0P2</name>
                     <description>SERCOM0/PAD2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SCOM0P2Select</name>
                        <enumeratedValue>
                           <name>RPA2</name>
                           <description>RPA2</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA14</name>
                           <description>RPA14</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB3</name>
                           <description>RPB3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB11</name>
                           <description>RPB11</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA1</name>
                           <description>RPA1</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA13</name>
                           <description>RPA13</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB2</name>
                           <description>RPB2</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB10</name>
                           <description>RPB10</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCOM0P3R</name>
               <addressOffset>0x4c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOM0P3</name>
                     <description>SERCOM0/PAD3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SCOM0P3Select</name>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA3</name>
                           <description>RPA3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA7</name>
                           <description>RPA7</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA11</name>
                           <description>RPA11</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB0</name>
                           <description>RPB0</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB4</name>
                           <description>RPB4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB8</name>
                           <description>RPB8</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB12</name>
                           <description>RPB12</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA2</name>
                           <description>RPA2</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA6</name>
                           <description>RPA6</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA10</name>
                           <description>RPA10</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA14</name>
                           <description>RPA14</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB3</name>
                           <description>RPB3</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB7</name>
                           <description>RPB7</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB11</name>
                           <description>RPB11</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCOM1P0R</name>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCOM1P0</name>
                     <description>SERCOM1/PAD0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SCOM1P0Select</name>
                        <enumeratedValue>
                           <name>RPA1</name>
                           <description>RPA1</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA5</name>
                           <description>RPA5</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA9</name>
                           <description>RPA9</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA13</name>
                           <description>RPA13</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB2</name>
                           <description>RPB2</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB6</name>
                           <description>RPB6</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB10</name>
                           <description>RPB10</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA0</name>
                           <description>RPA0</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA4</name>
                           <description>RPA4</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA8</name>
                           <description>RPA8</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPA12</name>
                           <description>RPA12</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB1</name>
                           <description>RPB1</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB5</name>
                           <description>RPB5</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB9</name>
                           <description>RPB9</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPB13</name>
                           <description>RPB13</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>OFF</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
